---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentPrintedEventArgs.GetFailedViewElementIds
source: html/3a67af27-5ec8-d59a-4a05-367c724e5cd9.htm
---
# Autodesk.Revit.DB.Events.DocumentPrintedEventArgs.GetFailedViewElementIds Method

Returns ElementIds of the views that that failed to print (if any).

## Syntax (C#)
```csharp
public IList<ElementId> GetFailedViewElementIds()
```

## Returns
ElementIds of the views that that failed to print (if any).